#+TITLE: NumLab 2016
#+DATE: Feb 5, 2016
#+AUTHOR:
#+EMAIL: juha.lento@csc.fi
#+REVEAL_THEME: simple
#+OPTIONS: toc:nil num:nil reveal_single_file:t

** Interacting with the job scheduler?

- through batch queue system commands, such as `srun`, `sbatch` and `squeue`
  (SLURM), and batch job scripts

#+BEGIN_SRC bash :results output drawer
squeue | head
sinfo -s
scontrol show partition test
#+END_SRC

#+RESULTS:
:RESULTS:
JOBID       USER     ACCOUNT           NAME     REASON   START_TIME     END_TIME  TIME_LEFT NODES CPUS   PRIORITY
8196472     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196473     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196474     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196602     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196603     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196645     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196646     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
8196647     estevez  csc             mumax3 AssocMaxJo          N/A 2016-01-29T1 14-00:00:00     1 1        914
7809241     hatavuor csc      dft-P-triph_D  Resources          N/A 2016-01-20T1 7-00:00:00     1 8        834
PARTITION AVAIL  TIMELIMIT   NODES(A/I/O/T)  NODELIST
serial*      up 3-00:00:00      858/8/1/867  c[3-304,309-440,449-474,477-478,579-983]
parallel     up 3-00:00:00      858/8/1/867  c[3-304,309-440,449-474,477-478,579-983]
longrun      up 14-00:00:0      854/8/1/863  c[3-304,313-440,449-474,477-478,579-983]
test         up      30:00          1/3/0/4  c[1-2,984-985]
hugemem      up 7-00:00:00          2/0/0/2  c[577-578]
PartitionName=test
   AllowGroups=ALL AllowAccounts=ALL AllowQos=ALL
   AllocNodes=ALL Default=NO
   DefaultTime=00:05:00 DisableRootJobs=NO GraceTime=0 Hidden=NO
   MaxNodes=2 MaxTime=00:30:00 MinNodes=1 LLN=NO MaxCPUsPerNode=UNLIMITED
   Nodes=c[1,2,984,985]
   Priority=15 RootOnly=NO ReqResv=NO Shared=NO PreemptMode=OFF
   State=UP TotalCPUs=80 TotalNodes=4 SelectTypeParameters=N/A
   DefMemPerNode=UNLIMITED MaxMemPerNode=UNLIMITED

:END:

